# EnergyAnalysisConstruction Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisConstruction Class
Members See Also
---
Represent an analytical construction as a composite of layered materials.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class EnergyAnalysisConstruction : Element
```

Visual Basic
---
```text
Public Class EnergyAnalysisConstruction _
	Inherits Element
```

Visual C++
---
```text
public ref class EnergyAnalysisConstruction : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..EnergyAnalysisConstruction
# See Also
EnergyAnalysisConstruction Members
Autodesk.Revit.DB.Analysis Namespace